docker_exp/docker_test/container/stress_10000_128byte.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.20 (be patient)


Server Software:        Apache/2.4.18
Server Hostname:        192.168.0.20
Server Port:            8090

Document Path:          /OS_ORDER_128byte.txt
Document Length:        218 bytes

Concurrency Level:      100
Time taken for tests:   1.602 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3960000 bytes
HTML transferred:       2180000 bytes
Requests per second:    6244.01 [#/sec] (mean)
Time per request:       16.015 [ms] (mean)
Time per request:       0.160 [ms] (mean, across all concurrent requests)
Transfer rate:          2414.68 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       4
Processing:     2   16   6.4     15      71
Waiting:        1   15   6.3     14      70
Total:          2   16   6.4     15      71

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     18
  75%     20
  80%     21
  90%     24
  95%     28
  98%     31
  99%     34
 100%     71 (longest request)