docker_exp/docker_test/container/stress_10000_256byte.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.20 (be patient)


Server Software:        Apache/2.4.18
Server Hostname:        192.168.0.20
Server Port:            8090

Document Path:          /OS_ORDER_256byte.txt
Document Length:        218 bytes

Concurrency Level:      100
Time taken for tests:   1.814 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3960000 bytes
HTML transferred:       2180000 bytes
Requests per second:    5511.34 [#/sec] (mean)
Time per request:       18.144 [ms] (mean)
Time per request:       0.181 [ms] (mean, across all concurrent requests)
Transfer rate:          2131.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     1   18   8.7     16      88
Waiting:        1   17   8.6     16      85
Total:          1   18   8.6     17      88

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     20
  75%     22
  80%     23
  90%     28
  95%     33
  98%     40
  99%     49
 100%     88 (longest request)