docker_exp/docker_test/container/stress_10000_512byte.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.20 (be patient)


Server Software:        Apache/2.4.18
Server Hostname:        192.168.0.20
Server Port:            8090

Document Path:          /OS_ORDER_512byte.txt
Document Length:        218 bytes

Concurrency Level:      100
Time taken for tests:   2.121 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3960000 bytes
HTML transferred:       2180000 bytes
Requests per second:    4715.84 [#/sec] (mean)
Time per request:       21.205 [ms] (mean)
Time per request:       0.212 [ms] (mean, across all concurrent requests)
Transfer rate:          1823.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     2   21  12.8     18     129
Waiting:        2   20  12.8     17     129
Total:          2   21  12.7     18     129

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     22
  75%     25
  80%     27
  90%     34
  95%     44
  98%     58
  99%     78
 100%    129 (longest request)