docker_exp/docker_test/container/stress_10000_64.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.20 (be patient)


Server Software:        Apache/2.4.18
Server Hostname:        192.168.0.20
Server Port:            8090

Document Path:          /OS_ORDER_64.txt
Document Length:        213 bytes

Concurrency Level:      100
Time taken for tests:   1.325 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3910000 bytes
HTML transferred:       2130000 bytes
Requests per second:    7546.40 [#/sec] (mean)
Time per request:       13.251 [ms] (mean)
Time per request:       0.133 [ms] (mean, across all concurrent requests)
Transfer rate:          2881.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     1   13   6.4     11     113
Waiting:        1   13   6.4     11     113
Total:          2   13   6.4     11     113

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     14
  75%     17
  80%     19
  90%     22
  95%     24
  98%     28
  99%     32
 100%    113 (longest request)